function setcity(provinceid, cityid) {
	var province = document.getElementById(provinceid).value;
    switch (province) {
        case "安徽" :
            var cityOptions = new Array(
            "合肥(*)", "合肥市",
            "安庆", "安庆市",
            "蚌埠", "蚌埠市",
            "亳州", "亳州市",
            "巢湖", "巢湖市",
            "滁州", "滁州市",
            "阜阳", "阜阳市",
            "淮北", "淮北市",
            "淮南", "淮南市",
            "黄山", "黄山市",
            "六安", "六安市",
            "马鞍山", "马鞍山市",
            "宿州", "宿州市",
            "铜陵", "铜陵市",
            "芜湖", "芜湖市",
            "宣城", "宣城市");
             break;
        case "北京" :
            var cityOptions = new Array(
            "北京", "北京市"
            );
            break;
        case "重庆" :
            var cityOptions = new Array(
            "重庆", "重庆市"
			);
            break;
        case "福建" :
            var cityOptions = new Array(
            "福州(*)", "福州市",
            "福安", "福安市",
            "龙岩", "龙岩市",
            "南平", "南平市",
            "宁德", "宁德市",
            "莆田", "莆田市",
            "泉州", "泉州市",
            "三明", "三明市",
            "邵武", "邵武市",
            "石狮", "石狮市",
            "晋江", "晋江市",
            "永安", "永安市",
            "武夷山", "武夷山市",
            "厦门", "厦门市",
            "漳州", "漳州市");
             break;
        case "甘肃" :
            var cityOptions = new Array(
            "兰州(*)", "兰州市",
            "白银", "白银市",
            "定西", "定西市",
            "敦煌", "敦煌市",
            "甘南", "甘南市",
            "金昌", "金昌市",
            "酒泉", "酒泉市",
            "临夏", "临夏市",
            "平凉", "平凉市",
            "天水", "天水市",
            "武威", "武威市",
            "张掖", "张掖市");
            break;
        case "广东" :
            var cityOptions = new Array(
            "广州(*)", "广州市",
            "潮阳", "潮阳市",
            "潮州", "潮州市",
            "澄海", "澄海市",
            "东莞", "东莞市",
            "佛山", "佛山市",
            "河源", "河源市",
            "惠州", "惠州市",
            "江门", "江门市",
            "揭阳", "揭阳市",
            "开平", "开平市",
            "茂名", "茂名市",
            "梅州", "梅州市",
            "清远", "清远市",
            "汕头", "汕头市",
            "汕尾", "汕尾市",
            "韶关", "韶关市",
            "深圳", "深圳市",
            "顺德", "顺德市",
            "阳江", "阳江市",
            "英德", "英德市",
            "云浮", "云浮市",
            "增城", "增城市",
            "湛江", "湛江市",
            "肇庆", "肇庆市",
            "中山", "中山市",
            "珠海", "珠海市");
            break;
        case "广西" :
            var cityOptions = new Array(
            "南宁(*)", "南宁市",
            "百色", "百色市",
            "北海", "北海市",
            "桂林", "桂林市",
            "防城港", "防城港市",
            "河池", "河池市",
            "贺州", "贺州市",
            "柳州", "柳州市",
            "来宾", "来宾市",
            "钦州", "钦州市",
            "梧州", "梧州市",
            "贵港", "贵港市",
            "玉林", "玉林市");
            break;
        case "贵州" :
            var cityOptions = new Array(
            "贵阳(*)", "贵阳市",
            "安顺", "安顺市",
            "毕节", "毕节市",
            "都匀", "都匀市",
            "凯里", "凯里市",
            "六盘水", "六盘水市",
            "铜仁", "铜仁市",
            "兴义", "兴义市",
            "遵义", "遵义市");
            break;
        case "海南" :
            var cityOptions = new Array(
            "海口(*)", "海口市",
			"三亚", "三亚市",
			"五指山", "五指山市",
			"琼海", "琼海市",
			"儋州", "儋州市",
			"文昌", "文昌市",
			"万宁", "万宁市",
			"东方", "东方市",
			"澄迈", "澄迈市",
			"临高", "临高市"
            );
            break;
        case "河北" :
            var cityOptions = new Array(
            "石家庄(*)", "石家庄市",
            "保定", "保定市",
            "沧州", "沧州市",
            "承德", "承德市",
            "邯郸", "邯郸市",
            "衡水", "衡水市",
            "廊坊", "廊坊市",
            "秦皇岛", "秦皇岛市",
            "唐山", "唐山市",
            "邢台", "邢台市",
            "张家口", "张家口市");
            break;
        case "黑龙江" :
            var cityOptions = new Array(
            "哈尔滨(*)", "哈尔滨市",
            "北安", "北安市",
            "大庆", "大庆市",
            "鹤岗", "鹤岗市",
            "黑河", "黑河市",
            "佳木斯", "佳木斯市",
            "鸡西", "鸡西市",
            "牡丹江", "牡丹江市",
            "齐齐哈尔", "齐齐哈尔市",
            "七台河", "七台河市",
            "双鸭山", "双鸭山市",
            "绥化", "绥化市",
            "伊春", "伊春市");
            break;
        case "河南" :
            var cityOptions = new Array(
            "郑州(*)", "郑州市",
            "安阳", "安阳市",
            "鹤壁", "鹤壁市",
            "焦作", "焦作市",
            "济源", "济源市",
            "开封", "开封市",
            "漯河", "漯河市",
            "洛阳", "洛阳市",
            "南阳", "南阳市",
            "平顶山", "平顶山市",
            "濮阳", "濮阳市",
            "三门峡", "三门峡市",
            "商丘", "商丘市",
            "新乡", "新乡市",
            "信阳", "信阳市",
            "许昌", "许昌市",
            "周口", "周口市",
            "驻马店", "驻马店市");
            break;
        case "香港" :
            var cityOptions = new Array(
            "香港", "香港香港特别行政区"
			);
            break;
        case "湖北" :
            var cityOptions = new Array(
            "武汉(*)", "武汉市",
            "恩施", "恩施市",
            "鄂州", "鄂州市",
            "黄冈", "黄冈市",
            "黄石", "黄石市",
            "荆门", "荆门市",
            "荆州", "荆州市",
            "潜江", "潜江市",
            "十堰", "十堰市",
            "随州", "随州市",
            "武穴", "武穴市",
            "仙桃", "仙桃市",
            "咸宁", "咸宁市",
            "襄樊", "襄樊市",
            "孝感", "孝感市",
            "宜昌", "宜昌市");
            break;
        case "湖南" :
            var cityOptions = new Array(
            "长沙(*)", "长沙市",
            "常德", "常德市",
            "郴州", "郴州市",
            "衡阳", "衡阳市",
            "怀化", "怀化市",
            "吉首", "吉首市",
            "娄底", "娄底市",
            "邵阳", "邵阳市",
            "湘潭", "湘潭市",
            "益阳", "益阳市",
            "岳阳", "岳阳市",
            "永州", "永州市",
            "张家界", "张家界市",
            "株洲", "株洲市");
            break;
        case "江苏" :
            var cityOptions = new Array(
            "南京(*)", "南京市",
            "常熟", "常熟市",
            "常州", "常州市",
            "海门", "海门市",
            "淮安", "淮安市",
            "江都", "江都市",
            "江阴", "江阴市",
            "昆山", "昆山市",
            "连云港", "连云港市",
            "南通", "南通市",
            "启东", "启东市",
            "宿迁", "宿迁市",
            "苏州", "苏州市",
            "太仓", "太仓市",
            "泰州", "泰州市",
            "无锡", "无锡市",
            "徐州", "徐州市",
            "盐城", "盐城市",
            "扬州", "扬州市",
            "宜兴", "宜兴市",
            "仪征", "仪征市",
            "张家港", "张家港市",
            "镇江", "镇江市");
            break;
        case "江西" :
            var cityOptions = new Array(
            "南昌(*)", "南昌市",
            "抚州", "抚州市",
            "赣州", "赣州市",
            "吉安", "吉安市",
            "景德镇", "景德镇市",
            "井冈山", "井冈山市",
            "九江", "九江市",
            "萍乡", "萍乡市",
            "上饶", "上饶市",
            "宜春", "宜春市",
            "鹰潭", "鹰潭市");
            break;
        case "吉林" :
            var cityOptions = new Array(
            "长春(*)", "长春市",
            "白城", "白城市",
            "白山", "白山市",
            "珲春", "珲春市",
            "辽源", "辽源市",
            "梅河", "梅河市",
            "吉林", "吉林市",
            "四平", "四平市",
            "松原", "松原市",
            "通化", "通化市",
            "延吉", "延吉市");
            break;
        case "辽宁" :
            var cityOptions = new Array(
            "沈阳(*)", "沈阳市",
            "鞍山", "鞍山市",
            "本溪", "本溪市",
            "朝阳", "朝阳市",
            "大连", "大连市",
            "丹东", "丹东市",
            "抚顺", "抚顺市",
            "阜新", "阜新市",
            "葫芦岛", "葫芦岛市",
            "锦州", "锦州市",
            "辽阳", "辽阳市",
            "盘锦", "盘锦市",
            "铁岭", "铁岭市",
            "营口", "营口市");
            break;
        case "澳门" :
            var cityOptions = new Array(
            "澳门", "澳门特别行政区");
            break;
        case "内蒙古" :
            var cityOptions = new Array(
            "呼和浩特(*)", "呼和浩特市",
            "包头", "包头市",
            "赤峰", "赤峰市",
            "集宁", "集宁市",
            "临河", "临河市",
            "通辽", "通辽市",
            "乌海", "乌海市",
            "乌兰浩特", "乌兰浩特市",
            "锡林浩特", "锡林浩特市");
            break;
        case "宁夏" :
            var cityOptions = new Array(
            "银川(*)", "银川市",
            "固原", "固原市",
            "石嘴山", "石嘴山市",
            "吴忠", "吴忠市");
            break;
        case "青海" :
            var cityOptions = new Array(
            "西宁(*)", "西宁市",
            "德令哈", "德令哈市",
            "格尔木", "格尔木市");
            break;
        case "山东" :
            var cityOptions = new Array(
            "济南(*)", "济南市",
            "滨州", "滨州市",
            "兖州", "兖州市",
            "德州", "德州市",
            "东营", "东营市",
            "菏泽", "菏泽市",
            "济宁", "济宁市",
            "莱芜", "莱芜市",
            "聊城", "聊城市",
            "临沂", "临沂市",
            "青岛", "青岛市",
            "日照", "日照市",
            "潍坊", "潍坊市",
            "威海", "威海市",
            "烟台", "烟台市",
            "枣庄", "枣庄市",
            "淄博", "淄博市");
            break;
        case "上海" :
            var cityOptions = new Array(
            "上海", "上海市");
            break;
        case "山西" :
            var cityOptions = new Array(
            "太原(*)", "太原市",
            "长治", "长治市",
            "大同", "大同市",
            "候马", "候马市",
            "临汾", "临汾市",
            "朔州", "朔州市",
            "忻州", "忻州市",
            "阳泉", "阳泉市",
            "运城", "运城市");
            break;
        case "陕西" :
            var cityOptions = new Array(
            "西安(*)", "西安市",
            "安康", "安康市",
            "宝鸡", "宝鸡市",
            "汉中", "汉中市",
            "渭南", "渭南市",
            "铜川", "铜川市",
            "咸阳", "咸阳市",
            "延安", "延安市",
            "榆林", "榆林市");
            break;
        case "四川" :
            var cityOptions = new Array(
            "成都(*)", "成都市",
            "巴中", "巴中市",
            "德阳", "德阳市",
            "都江堰", "都江堰市",
            "峨眉山", "峨眉山市",
            "广安", "广安市",
            "广元", "广元市",
            "乐山", "乐山市",
            "泸州", "泸州市",
            "绵阳", "绵阳市",
            "眉山", "眉山市",
            "南充", "南充市",
            "内江", "内江市",
            "攀枝花", "攀枝花市",
            "遂宁", "遂宁市",
            "西昌", "西昌市",
            "雅安", "雅安市",
            "宜宾", "宜宾市",
            "自贡", "自贡市",
            "资阳", "资阳市");
            break;
        case "台湾" :
            var cityOptions = new Array(
            "台北(*)", "台北市",
            "台南", "台南市",
            "台中", "台中市",
            "高雄", "高雄市",
            "桃源", "桃源市");
            break;
        case "天津" :
            var cityOptions = new Array(
            "天津", "天津市" );
            break;
        case "新疆" :
            var cityOptions = new Array(
            "乌鲁木齐(*)", "乌鲁木齐市",
            "阿克苏", "阿克苏市",
            "阿勒泰", "阿勒泰市",
            "昌吉", "昌吉市",
            "哈密", "哈密市",
            "和田", "和田市",
            "喀什", "喀什市",
            "克拉玛依", "克拉玛依市",
            "库尔勒", "库尔勒市",
            "奎屯", "奎屯市",
            "石河子", "石河子市");
            break;
        case "西藏" :
            var cityOptions = new Array(
            "拉萨(*)", "拉萨市",
            "日喀则", "日喀则市");
            break;
        case "云南" :
            var cityOptions = new Array(
            "昆明(*)", "昆明市",
            "大理", "大理市",
            "保山", "保山市",
            "楚雄", "楚雄市",
            "个旧", "个旧市",
            "景洪", "景洪市",
            "开远", "开远市",
            "临沧", "临沧市",
            "丽江", "丽江市",
            "曲靖", "曲靖市",
            "玉溪", "玉溪市",
            "昭通", "昭通市");
            break;
        case "浙江" :
            var cityOptions = new Array(
            "杭州(*)", "杭州市",
            "慈溪", "慈溪市",
            "奉化", "奉化市",
            "海盐", "海盐市",
            "湖州", "湖州市",
            "嘉兴", "嘉兴市",
            "金华", "金华市",
            "临安", "临安市",
            "临海", "临海市",
            "宁波", "宁波市",
            "平湖", "平湖市",
            "衢州", "衢州市",
            "江山", "江山市",
            "瑞安", "瑞安市",
            "绍兴", "绍兴市",
            "嵊州", "嵊州市",
            "台州", "台州市",
            "温岭", "温岭市",
            "温州", "温州市",
			"余姚", "余姚市",
			"舟山", "舟山市");
            break;
        
        default:
            var cityOptions = new Array("选择城市", "");
            break;
    }

	var cityObject = document.getElementById(cityid);
	cityObject.options.length = 0;
	cityObject.options[0] = new Option("选择城市", "");
	var j = 0;
	for(var i = 0; i < cityOptions.length/2; i++) {
		j = i + 1;
	    cityObject.options[j] = new Option(cityOptions[i*2],cityOptions[i*2+1]);
	}
}

function initprovcity(provinceid, province) {
	var provObject = document.getElementById(provinceid);
    for(var i = 0; i < provObject.options.length; i++) {
        if (provObject.options[i].value == province) {
        	provObject.selectedIndex = i;
			break;
        }
    }
    //setcity(provinceid, cityid);
}

function showprovince(provinceid, cityid, province) {
	var provinces = new Array(
		"北京", "上海", "重庆", "天津", "安徽", "福建", "甘肃", "广东", "广西", "贵州", "海南", "河北", "黑龙江", "河南",
		"香港", "湖北", "湖南", "江苏", "江西", "吉林", "辽宁", "澳门", "内蒙古", "宁夏", "青海", "山东",
		"山西", "陕西", "四川", "台湾", "新疆", "西藏", "云南", "浙江"
	);

	var html = "<select  class=\"select\" name=\"" + provinceid + "\" id=\"" + provinceid + "\" onchange=\"setcity('" + provinceid + "', '" + "city" + "');\">";
	html = html + "<option value=\"\">选择省份</option>";
	for(var i = 0; i < provinces.length; i++) {
		html = html + "<option value=\"" + provinces[i] + "\">" + provinces[i] + "</option>";
	}
	html = html + "</select>";
	document.write(html);

	initprovcity(provinceid, province);

}

function showcity(cityid, city) {
	var html = "<select  class=\"select\" name=\"" + cityid + "\" id=\"" + "city" + "\">";
	if(city == "") {
		html = html + "<option value=\"\">选择城市</option>";
	} else {
		html = html + "<option value=\"" + city + "\">" + city + "</option>";
	}
	html = html + "</select>";
	document.write(html);
}